
var markPoints = [{
	name: "青丘堌堆遗址",
	address: "地址：山东省菏泽市牡丹区寺西范村村东",
	imagePath: "../static/qqg.jpg",
	coord: [115.287249,35.161635],
	text: "青丘堌堆遗址，距菏泽城西南30余里的寺西范村，这里属于高新区马岭岗镇的辖区。在村东100米处，看到了一个高高突兀的堌堆，上面还有一个双檐塔式大殿，显得巍巍大观。走近堌堆，前方有块方碑，上面刻有“青邱堌堆遗址”六个大字，还有“山东省第四批省级文物保护单位”及“菏泽市人民政府 · 2014年立”字样。后面还有多块重建青邱寺的“捐资功德碑”，左右是简易的厢房，应为寺中人所用。围堌堆环绕一周，底部东西长约50米，南北宽约35米，堌堆高达7米。北、西、东三面为三级台层，呈现为覆斗状。南面陡直如壁，据说是后人取土所致，中间已向上修筑了水泥台阶。"
},{
	name: "恒然生态园",
	address: "地址：山东省菏泽市牡丹区220国道鲁中石化往南500米路西",
	phone: "电话：19157335777",
	imagePath: "../static/hrsty.jpg",
	coord: [115.368084,35.19443],
	text: "恒然生态园项目位于菏泽高新区马岭岗镇240国道西侧，总占地面积1200亩，目前，园区内已建成占地面积6000平方米的智能温室1座，温室大棚4座，现代农业示范园区430亩，主要规划花卉观赏、果蔬采摘、中药材种植、农耕展示、都市农业体验五大板块。生态园内有菏泽市第一架智能玻璃小番茄大棚、农耕展示区，童体验区、中药种植区、月季园、蔬菜种植区，西瓜种植区、2分田体验区，儿童一块田体验区、梨树种植区，石榴种植区，樱桃种植区、2分田都市农业体验区、水果玉米认领区、休闲垂钓区、农田租赁区、家禽家畜领养区。"
},{
	name: "冀鲁豫边区革命纪念馆",
	address: "地址：山东省菏泽市牡丹区丹阳路1111号",
	phone: "电话：(0530)5167903",
	imagePath: "../static/jly.jpg",
	time: "开放时间：上午9:00--11:30 下午14:00--17:00",
	coord: [115.480852,35.243119],
	text: "1998年4月奠基，2000年5月建成开馆。占地198亩，建筑面积11700余平方米，总投资6500余万元，集展厅、画馆、广场建设于一体。广场内绿化面积近6万平方米，是青少年学生和广大干部群众进行爱国主义教育的良好场所。被命名为“全国爱国主义教育示范基地＂和“全国重点革命烈士纪念物保护单位”，同时还被命名为“全国青少年教育基地”，“国家AAA级旅游景区”等。"
},{
	name: "菏泽市烈士陵园",
	address: "地址：山东省菏泽市牡丹区刘寨村X121与国花大道交叉口南390米路东",
	phone: "",
	imagePath: "../static/lsly.jpg",
	coord: [115.447639,35.31459],
	text: "新烈士陵园是城郊公园的一部分，规划设计总面积约498亩，一期计划投资3000万元。公园北部为烈士陵园，南部为休闲公园，共分烈士褒扬区、革命公墓区、文化休闲区、休闲活动区、生态游赏区等五大功能区。纪念馆在保留现有史料并扩大征集烈士史料的基础上，以烈士事迹、烈士遗物，烈士名录为主线，以战役为辅，分时期、分部分展示我市革命烈士史迹，其展示分为序厅、土地革命战争时期、抗日战争时期、解放战争时期、社会主义革命和建设时期、英烈名录厅六大部分。"
},{
	name: "鲁西南烈士陵园",
	address: "地址：山东省菏泽市曹县姜庄村",
	phone: "",
	imagePath: "../static/lxnlsly.jpg",
	coord: [115.344554,35.031089],
	time: "开放时间：8：00-17：00",
	text: "鲁西南革命烈士陵园坐落在曹县西北部古遗址安陵固堆。是为了纪念国捐躯的烈士而建。占地百余亩，主要纪念建筑物有革命烈士纪念堂、鲁西南抗日烈士纪念塔、纪念碑亭等。1988年1月被批准为省级重点烈士纪念建筑物保护单位。为国家级抗战纪念设施遗址和国家级烈士纪念设施，是菏泽市建园最早、保存最好、安葬革命烈士最多、著名英烈最多的一处陵园，也是山东省较早的烈士陵园之一。"
},{
	name: "曹州牡丹园",
	address: "地址：山东省菏泽市牡丹区人民路1000号",
	phone: "电话：(0530)5640177",
	coord: [115.497379,35.279915],
	imagePath: "../static/czmdy.jpg",
	text: "曹州牡丹园位于菏泽市人民北路，东临中国林展馆，是世界上面积最大的牡丹观赏园。它是以明清以来赵氏园、桑篱园、桂陵园等十几处牡丹园林为基础，于1982年修建。该园占地近2000亩，1100多个品种，其中百年以上株龄的古牡丹一百余株。"
},{
	name: "马岭岗镇通古集文化大院",
	address: "地址：菏泽市牡丹区儒学研究会附近",
	phone: "",
	coord: [115.274704,35.191224],
	imagePath: "../static/tgj.png",
	text: "通古集村，曾叫通堌集，位于山东省菏泽牡丹区西南部，古属冤句所在地，现属牡丹区马岭岗镇。村中现有居民以贾姓人最多，迁来时间最早，今通古集东建有文化大院和菏泽市儒学研究会大成殿。"
},{
	name: "红三村抗日联防遗址",
	address: "地址：山东省菏泽市曹县韩集镇刘岗曹楼伊庄行政村	",
	phone: "电话：(0530)3217578",
	coord: [115.324039,35.016574],
	imagePath: "../static/hsc.jpg",
	text: "红三村抗日联防遗址，位于曹县韩集乡的刘岗、曹楼、伊庄三村。地当山东、河南、河北之曹县、定陶、菏泽、东明、考城交界处。三村相距各1公里多，呈鼎足之势，是鲁西南抗日根据地的中心。传说日本侵略军在军用地图上用红笔把三村圈在一起，并写上一个大“赤”字，故称“红三村”。"
},{
	name: "王浩屯镇烈士陵园",
	address: "地址：菏泽市牡丹区东郑线王浩屯客运站西北侧约120米",
	phone: "",
	time: "开放时间：9:00-16:30",
	imagePath: "../static/wht.png",
	coord: [115.308237,35.129461],
	text: "王浩屯镇烈士陵园位于菏泽市牡丹区东郑线王浩屯客运站西北侧约140米，陵园建有烈士纪念碑、仿古式烈士纪念堂、烈士陵园大门、祭奠广场、长廊、石雕、烈士铜像等，园区绿化、美化、硬化及声、光、电改造设施齐全，广场内建大型浮雕一座，喷泉一处，碑亭3座，配置了广场路灯、景观灯、大型宣传橱窗等基础设施。已成为集烈士褒扬、宣传教育、休闲娱乐于一体的红色旅游和爱国主义教育基地。"
},{
	name: "张和庄社区红色传承馆",
	address: "地址：山东省菏泽市牡丹区佃户屯街道张和庄村",
	phone: "",
	coord: [115.476944,35.186276],
	imagePath: "../static/zhz.png",
	text: "张和庄烈士陵园（张和庄社区红色传承馆），位于山东省菏泽开发区佃户屯街道，有170位烈士，其中有鲁西南革命创始人田位东烈士，有33位开发区佃户屯藉烈士，另外136位无名烈士是原华东野战军第八纵队23师革命烈士。"
},{
	name: "毛主席像章馆",
	address: "地址：山东省菏泽市牡丹区中华西路369号",
	phone: "电话：(0530)5299256,(0530)5299369,(0530)5634114,(0530)5923379",
	coord: [115.080765,35.358655],
	imagePath: "../static/mzx.jpg",
	text: "步长医药产业园有有一座毛泽东主席像章珍藏馆，在毛泽东主席像章馆大厅内，墙上的毛主席巨幅像章画《万里长城》，长26米，高5米，整幅作品共使用各类像章189300枚。"
}]

function getMarkPoints() {
	let targetTime = new Date('2023/03/06').getTime();
	if(new Date().getTime() > targetTime) {
		return markPoints;
	}else{
		return []
	}
}
export default getMarkPoints;